# Author: Nic Vetter 

# Module 4 - Project - Task 2

## Task 1 - Create a Data Frame

In [77]:
import pandas as pd

In [78]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [84, 77, 90],'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}

In [79]:
grades = pd.DataFrame(grades_dict)

In [80]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   84    100   83
1     96   87   77     81   65
2     70   90   90     82   85

## Task 2 - Custom Index

In [81]:
grades.index = ['Test 1', 'Test 2', 'Test 3']

In [82]:
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   84    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [83]:
grades['Eva']

Test 1    100
Test 2     87
Test 3     90
Name: Eva, dtype: int64

In [84]:
grades.Sam

Test 1    84
Test 2    77
Test 3    90
Name: Sam, dtype: int64

## Task 3 Accessing Rows (loc, iloc) - I enjoy using loc the most because it seems to have a lot more usage since it can use strings and integers

In [85]:
grades.loc['Test 1']

Wally     87
Eva      100
Sam       84
Katie    100
Bob       83
Name: Test 1, dtype: int64

In [86]:
grades.iloc[0]

Wally     87
Eva      100
Sam       84
Katie    100
Bob       83
Name: Test 1, dtype: int64

In [87]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test 2, dtype: int64

In [88]:
grades.iloc[0:2]

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   84    100   83
Test 2     96   87   77     81   65

In [89]:
grades.loc['Test 1':'Test 3']

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   84    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

## Task 3 - Accessing Subsets (at, iat)

In [90]:
grades.at['Test 2', 'Eva']

87

In [91]:
grades.iat[2,0]

70

## Task 4 - Describe (By Column)

In [92]:
grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  83.67   87.67  77.67
std    13.20    6.81   6.51   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  80.50   81.50  74.00
50%    87.00   90.00  84.00   82.00  83.00
75%    91.50   95.00  87.00   91.00  84.00
max    96.00  100.00  90.00  100.00  85.00

In [93]:
pd.set_option('display.precision',2)

## Task 5 - Transpose (rows <--> columns)

In [94]:
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   84    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [95]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      83.67
Katie    87.67
Bob      77.67
dtype: float64

In [96]:
grades.T

       Test 1  Test 2  Test 3
Wally      87      96      70
Eva       100      87      90
Sam        84      77      90
Katie     100      81      82
Bob        83      65      85

In [97]:
grades.T.describe()

       Test 1  Test 2  Test 3
count    5.00    5.00    5.00
mean    90.80   81.20   83.40
std      8.53   11.54    8.23
min     83.00   65.00   70.00
25%     84.00   77.00   82.00
50%     87.00   81.00   85.00
75%    100.00   87.00   90.00
max    100.00   96.00   90.00

## Task 6 - Sort

In [98]:
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   84    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [99]:
grades.sort_index(ascending=False)

        Wally  Eva  Sam  Katie  Bob
Test 3     70   90   90     82   85
Test 2     96   87   77     81   65
Test 1     87  100   84    100   83

In [100]:
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   84    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [101]:
grades.sort_index(axis=1)

        Bob  Eva  Katie  Sam  Wally
Test 1   83  100    100   84     87
Test 2   65   87     81   77     96
Test 3   85   90     82   90     70

## I enjoyed this project as it showed me base level analysis that can be performed with a tools as powerful as Jupyter and Pandas.